{
    "musicians":[{
        "name": "ONE OK ROCK",
        "shortname": "ONE_OK_ROCK",
        "biography": "Japanese quartet One OK Rock is a Japanese power pop/alt-rock band that draws on the sounds of American bands like blink-182, Foo Fighters, and Linkin Park. Named for the time of the band's scheduled practice time, the group was established in 2005 by high schooler Toru Yamashita (guitar), who teamed with bassist Ryota Kohama, vocalist Takahiro Moriuchi (known simply as Taka, formerly of boy band NEWS), and another guitarist, the San Francisco-born Alex Onizawa, who was later replaced by Tomoya Kanki. After a string of successful shows around Tokyo, the band debuted with the EP One OK Rock in mid-2006, followed by another mini-album, Keep It Real, by the end of the same year. In 2006, One OK Rock finally found a permanent drummer in Tomoya, who played on their first single, 'Naihi Shinsho', which made its way to national radio and secured the band a deal with major-label Amuse. A nationwide tour preceded the release of the band's debut studio album, Zeitakubyou, which was followed by two LPs, Beam of Light and Kanjou Effect, in 2008. The following year, Onizawa parted ways with the group, leaving Toru to handle all the guitar duties. One OK Rock released their fourth full-length album, Niche Syndrome, in 2010. They quickly returned with Zankyo Reference in 2011, and two years later delivered Jinsei × Boku on A-Sketch. One OK Rock then toured the U.S. as part of the Vans Warped Tour in 2014 before returning to play stadium shows in Japan and South America later in the year. The album 35xxxv arrived in early 2015 and was re-released in a deluxe English-language edition after the band signed with Warner Bros. in late 2015. They crossed over in the U.S. thanks in part to Taka's English language abilities. In 2016, the band signed with Fueled by Ramen and set about recording their second international album. Titled Ambitions and released in January 2017, it was a slicker, even more commercial proposition that took on some of the label's trademark characteristics. An opening slot on Linkin Park's 2017 world tour was canceled after the suicide of that band's frontman Chester Bennington (Taka later participated in a tribute concert to the late vocalist). In early 2018, the band issued the single ",
        "tour":[{
            "place": "Houston, Texas",
            "stage": "House of Blues Houston",
            "date": "Monday, Mar 11, 2019"
        },{
            "place": "Minneapolis, Minnesota",
            "stage": "Varsity Theatre",
            "date": "Friday, February 22, 2019"
        },{
            "place": "Montreal, Quebec, Canada",
            "stage": "National",
            "date": "Friday, March 1, 2019"
        }],
        "album":[{
            "name": "Jinsei x Boku =",
            "songs":[{
                "name": "Introduction~Where idiot should go"
            },{
                "name": "Ending Story??"
            },{
                "name": "ONION!"
            },{
                "name": "The Beginning"
            },{
                "name": "Clock Strikes"
            },{
                "name": "Be the light"
            },{
                "name": "Nothing Helps"
            },{
                "name": "Junvenile"
            },{
                "name": "All Mine"
            },{
                "name": "Smiling Down"
            },{
                "name": "Deeper Deeper"
            },{
                "name": "69"
            },{
                "name": "the same as..."
            }]
        }]
    },{
        "name": "Red Velvet",
        "shortname": "Red_Velvet",
        "biography": "Inspired by artists like En Vogue, Destiny's Child, and Gwen Stefani, South Korea's Red Velvet are a five-member, all-female vocal group who make dance-oriented contemporary R&B and rap-infused pop. Formed by music management giant S.M. Entertainment in Seoul, South Korea in 2014, Red Velvet feature the talents of former S.M. Rookies Seulgi (Kang Seul-gi), Irene (Bae Joo-hyun), and Wendy (Son Seung-wan), as well as Joy (Park Soo-young) and Yeri (Kim Ye-rim). The group's two initial singles, 2014's 'Happiness' and 'Natural,' fared well with audiences and became some of South Korea's most watched online videos during the month of their release. In March 2015, Red Velvet released their debut EP, 'Ice Cream Cake', which included the single Automatic and debuted at number two on Billboard's World Albums chart. Their first full-length, The Red, arrived in September 2015. The album topped both the Billboard World Albums and the Korean Albums charts atop the success of the single 'Dumb Dumb.' An R&B-influenced follow-up, The Velvet, arrived in 2016, with EP number three, Russian Roulette, released just months later. Another chart-topper, Rookie: The 4th Mini Album, was issued in January 2017. Several months later, Red Velvet delivered their sophomore album, the aptly titled Perfect Velvet: The 2nd Album. Buoyed by the single 'Peek-a-Boo,' the album topped the Billboard World Albums chart. The Summer Magic EP arrived in 2018, and included the single 'Power Up,' as well as an English version of 'Bad Boy'.",
        "tour":[{
            "place": "Pasadena, California",
            "stage": "The Pasadena Civic",
            "date": "Friday, February 8, 2019"
        },{
            "place": "Chicago, Illinois",
            "stage": "The Chicago Theatre",
            "date": "Friday, February 15, 2019"
        },{
            "place": "Toronto, Canada",
            "stage": "Coca-Cola Coliseum",
            "date": "Tuesday, February 19, 2019"
        }],
        "album":[{
            "name": "The Perfect Red Velvet",
            "songs":[{
                "name": "Bad Boy"
            },{
                "name": "All Right"
            },{
                "name": "Peek-A-Boo"
            },{
                "name": "Look"
            },{
                "name": "I Just"
            },{
                "name": "Kingdom Come"
            },{
                "name": "Time to Love"
            },{
                "name": "My Second Date"
            },{
                "name": "Attaboy"
            },{
                "name": "Perfect 10"
            },{
                "name": "About Love"
            },{
                "name": "Moonlight Melody"
            }]
        }]
    },{
        "name": "TWICE",
        "shortname": "TWICE",
        "biography": "Seoul-based girl group Twice features members from Korea, Japan, and Taiwan performing bright, catchy pop tunes. Formed by JYP Entertainment in 2015 on the reality show Sixteen, Twice is comprised of leader and main vocalist Jihyo Park, Nayeon Im, Jeongyeon Yoo, Dahyun Kim, and Chaeyoung Son from South Korea; Momo Hirai, Sana Minatozaki, and Mina Myoui from Japan; and Tzuyu Chou from Tainan, Taiwan. The nine women made their debut in late 2015 with the EP The Story Begins, which featured the single 'Like Ooh-Ahh.' Months later, they issued Page Two, which saw Twice continue to climb the charts in their three home countries and the United States. In late 2016, third EP Twicecoaster: Lane 1 was released, followed by a quick reissue titled Twicecoaster: Lane 2, which peaked in the Top Five of the Korean, Taiwanese, and Billboard World charts upon release in early 2017. The Twicecoaster releases spawned the hit singles 'TT' and 'Knock Knock.' Their fourth EP, Signal, arrived that spring. It became their third Korean and fourth Taiwanese chart-topper, peaking at number three on the Billboard World chart. Later that summer, they followed the success of Signal with a push into the Japanese-language market. #Twice included Japanese re-recordings of their biggest singles and was the first time Twice charted in New Zealand. Led by the single 'Likey,' they released their debut full-length, Twicetagram, in October of that year, topping a number of charts including Korea, Taiwan, and the U.S. World Albums. The single 'Candy Pop' followed in February 2018. The chart-topping hit landed on sophomore full-length -- and first Japanese-language effort -- BDZ, which was released in September. Their debut Twicetagram topped the Korean, Taiwanese, and U.S. World charts upon release in 2017.",
        "tour":[{
            "place": "Hong Kong, Hong Kong",
            "stage": "AsiaWorld Expo - Arena (Hall 1)",
            "date": "Saturday, January 19, 2019"
        },{
            "place": "Osaka, Japan",
            "stage": "Kyocera Dome",
            "date": "Thursday, March 21, 2019"
        },{
            "place": "Tokyo, Japan",
            "stage": "Tokyo Dome",
            "date": "Saturday, March 30, 2019"
        }],
        "album":[{
            "name": "Yes or Yes",
            "year": "2018",
            "songs":[{
                "name": "YES or YES"
            },{
                "name": "SAY YOU LOVE ME"
            },{
                "name": "LALALA"
            },{
                "name": "YOUNG & WILD"
            },{
                "name": "SUNSET"
            },{
                "name": "AFTER MOON"
            },{
                "name": "BDZ - Korean Version"
            }]
        }]
    },{
        "name": "BLACKPINK",
        "shortname": "BLACKPINK",
        "biography": "K-pop girl group BlackPink made their breakthrough in 2016 with their hip-hop- and trap-influenced brand of energetic dance pop. The quartet, formed by YG Entertainment, combines the talents of Korean-born lead vocalist Jisoo Kim, New Zealand-raised main rapper/vocalist Jennie Kim, Australian-raised main vocalist Rose Park Chae Young, and Thai lead rapper Lalisa Manoban (aka Lisa, born Pranpriya Manoban). BlackPink debuted with their single Square One, which featured the hits 'Boombayah' and 'Whistle.' Produced and written with Teddy Park, Future Bounce, and Bekuh Boom, Square One introduced a 'K-trap' style that sounded like 2NE1 blended with BTS. Both tracks climbed the charts in the United States and Korea, even breaking into the French singles chart. Months later, they released Square Two, which entered the U.S. Heatseekers chart at number 13 and the World Albums chart at number two. Square Two also became the first debut for a K-pop girl group on the Canadian charts. In the summer of 2017, the group issued the chart-topping single 'As If It's Your Last,' their third to top the Billboard World Digital Songs chart. Months later, they made their Japanese debut with the Blackpink EP (YGEX/Avex Entertainment), which compiled past hits in newly recorded Japanese versions. Topping the Japanese charts, BlackPink became just the third foreign artist debut to do so. Re:BlackPink arrived in early 2018, combining previously issued tracks from both Japanese and Korean releases. The Square Up EP arrived that summer, headed by the single 'DDU-DU DDU-DU.' In addition to entering the U.K. trending chart, the song became the highest showing on the Billboard Hot 100 by an all-female K-pop group (following Wonder Girls' 2009 hit 'Nobody'). The EP also made moves on the Billboard 200, becoming the highest-charting all-female K-pop effort to date at number 40. Later that year, the group signed a global partnership deal with Interscope/Universal.",
        "tour":[{
            "place": "Bangkok, Thailand",
            "stage": "Impact Arena",
            "date": "Saturday, January 12 2019"
        },{
            "place": "Jarkata, Indonesia",
            "stage": "Indonesia Convention Exhibition",
            "date": "Saturday, January 19 2019"
        },{
            "place": "Hong Kong, Hong Kong",
            "stage": "AsiaWorld Expo - Arena (Hall 1)",
            "date": "Saturday, January 26 2019"
        }],
        "album":[{
            "name": "Blackpink in Your Area",
            "year": "2018",
            "songs":[{
                "name": "BOOMBAYAH"
            },{
                "name": "WHISTLE"
            },{
                "name": "PLAYING WITH FIRE"
            },{
                "name": "STAY"
            },{
                "name": "AS IF IT'S YOUR LAST"
            },{
                "name": "DDU-DU DDU-DU"
            },{
                "name": "FOREVER YOUNG"
            },{
                "name": "REALLY"
            },{
                "name": "SEE YOU LATER"
            }]
        }]
    }]
}